//2. Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.
var c, d, result;
c=15;
d=2;
result= c+d;
alert(result)


//3. Создайте переменные a=10, b=2 и c=5. Выведите на экран их сумму.

var a, b, c, result;
a=10;
b=2;
c=5;
result = a+b+c;
alert(result)
//4. Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение 7.
var a, b, c, d;
a=17;
b=10;
c= a - b;
d =7;



//5. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.
result = c+d;;
alert(result);

//6. Создайте переменную str и присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной на экран.

var str;
str = "Привет, Мир!";
alert(str);

//7. Создайте переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'.
var str1, str2;
str1="Привет,"
str2= " Мир!"
alert(str1 + str2)

//8. Создайте переменную name и присвойте ей ваше имя. = Выведите на экран фразу 'Привет, %Имя%!'.
var NAME;
NAME = "Виктор"
alert(str1+" "+NAME+"!")
//9. Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'.

var age;
age =32;
alert("Мне "+ age +" лет!" )